Revit 2027 API
ColorFillScheme.AreaSchemeId Property
 Represents the id of AreaScheme of area plan views that this scheme could be applied to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AreaSchemeId { get; }
Public ReadOnly Property AreaSchemeId As ElementId
	Get
public:
property ElementId^ AreaSchemeId {
	ElementId^ get ();
}
member AreaSchemeId : ElementId with get
Property Value
ElementId
Remarks
 Only meaningful if the CategoryId is OST_Areas.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace